app/Controllers/ClientController.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 69
---
    public function doDepot()
    {
        $clientId = session()->get('client_id');
        $montant = (float) $this->request->getPost('montant');

        if (!$montant || $montant <= 0) {
            return redirect()->back()->withInput()->with('error', 'Montant invalide.');
        }

        $client = $this->clientModel->find($clientId);