app/Models/TransactionModel.php

    public function getTransactionsByClient($clientId, $limit = null)
    {
        $builder = $this->select('transactions.*, types_operations.nom as type_nom, types_operations.code')
                        ->join('types_operations', 'types_operations.id = transactions.type_operation_id')
                        ->where('client_id', $clientId)
                        ->orderBy('date_transaction', 'DESC');
        if ($limit) {
            $builder->limit($limit);
        }
        return $builder->findAll();
---
SELECT `transactions`.*, `types_operations`.`nom` as `type_nom`, `types_operations`.`code`
FROM `transactions`
JOIN `types_operations` ON `types_operations`.`id` = `transactions`.`type_operation_id`
WHERE `client_id` = 69
ORDER BY `date_transaction` DESC